Revit 2027 API
RibbonItem.Name Property
The name of the item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
public:
property String^ Name {
	String^ get ();
}
member Name : string with get
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  Thrown when setting the text to empty or to the string contains "%".
See Also
Reference
RibbonItem Class
Autodesk.Revit.UI Namespace